cguenther0929/power_logger/power_logger.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F1
ProjectManager.MainLocation=Core/Src
RCC.MCOFreq_Value=72000000
PCC.Series=STM32F1
PB13.GPIOParameters=GPIO_Label
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F105VBHx
PB10.Mode=I2C
PCC.Seq0.Step0.CPU_Frequency=72 MHz
TIM1.IPParameters=Channel-Output Compare1 No Output,Prescaler,Period
PCC.Seq0.Step0.User's_Consumption=0 mA
RCC.PLLCLKFreq_Value=72000000
PB14.GPIO_Label=SD_SPI2_MISO
PA14.GPIO_Label=SWCLK
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC1_Init-ADC1-false-HAL-true,4-MX_I2C2_Init-I2C2-false-HAL-true,5-MX_FATFS_Init-FATFS-false-HAL-false,6-MX_USART1_UART_Init-USART1-false-HAL-true,7-MX_TIM1_Init-TIM1-false-HAL-true
PA9.GPIOParameters=GPIO_Label
PC0.GPIOParameters=GPIO_Label,GPIO_Mode
PC0.GPIO_Label=IN_FD_V
PA3.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
RCC.ADCFreqValue=12000000
PA6.GPIO_Label=ADC_SPI1_MISO
USART1.IPParameters=VirtualMode
PCC.Seq0.Step1.Duration=0.95 ms
PB13.GPIO_Label=SD_SPI2_CLK
PB11.Signal=I2C2_SDA
PB15.Signal=SPI2_MOSI
PB13.Signal=SPI2_SCK
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
VP_TIM1_VS_no_output1.Mode=Output Compare1 No Output
PE1.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
PD13.Signal=GPIO_Input
Mcu.IP4=RCC
RCC.FCLKCortexFreq_Value=72000000
Mcu.IP5=SYS
PD13.Locked=true
Mcu.IP2=I2C2
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PCC.Seq0.Step1.Oscillator=Regulator_LP
Mcu.IP3=NVIC
Mcu.IP0=ADC1
Mcu.IP1=FATFS
SH.GPXTI3.ConfNb=1
TIM1.Prescaler=1000
PCC.PartNumber=STM32F105VBHx
PD15.GPIOParameters=GPIO_Label
Mcu.UserConstants=
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=72000000
Mcu.IPNb=8
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=72000000
PCC.Seq0.Step1.TaMax=105
Mcu.Pin6=PE1
Mcu.Pin7=PA9
Mcu.Pin8=OSC_OUT
OSC_OUT.Mode=HSE-External-Oscillator
Mcu.Pin9=PE0
PCC.Seq0.Step1.Category=In DS Table
PE1.Signal=GPIO_Output
OSC_OUT.Signal=RCC_OSC_OUT
RCC.AHBFreq_Value=72000000
PB13.Locked=true
Mcu.Pin0=PE2
Mcu.Pin1=PB9
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PB3
Mcu.Pin3=PA14
Mcu.Pin4=PA13
Mcu.Pin5=OSC_IN
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_10
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=12000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.PLL3CLKoutputFreqValue=96000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PCC.Seq0.Step1.Vdd=3.3
PB3.Mode=Trace_Asynchronous_SW
PA4.Locked=true
PCC.Seq0.Step0.Voltage_Source=Battery
PCC.Seq0.Step0.DMIPS=90.0
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.PLLMUL=RCC_PLL_MUL6
PB12.GPIO_Label=SD_SPI2_CSn
ProjectManager.FirmwarePackage=STM32Cube FW_F1 V1.8.4
MxDb.Version=DB.6.0.21
PE0.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
VP_TIM1_VS_no_output1.Signal=TIM1_VS_no_output1
PA14.Mode=Trace_Asynchronous_SW
File.Version=6
PA10.GPIO_Label=CONSOLE_RXD
PB3.GPIOParameters=GPIO_Label
PE2.Signal=GPIO_Output
PE1.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
VP_TIM1_VS_ClockSourceINT.Mode=Internal
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
ProjectManager.ProjectName=power_logger
PA13.GPIOParameters=GPIO_Label
PCC.Seq0.Step0.Oscillator=HSE PLL
PD13.GPIO_Label=REV_0
PB9.Signal=GPIO_Output
Mcu.Package=LFBGA100
PA6.Signal=SPI1_MISO
PA5.Locked=true
PA7.Locked=true
VP_FATFS_VS_Generic.Signal=FATFS_VS_Generic
RCC.I2S2Freq_Value=72000000
PA14.Locked=true
ProjectManager.ToolChainLocation=
PD14.Locked=true
PCC.Seq0.Step1.Average_Current=26 \u00B5A
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=USART1_RX
RCC.PLL2CLKoutputFreqValue=96000000
PCC.Checker=false
PA5.GPIOParameters=GPIO_Label
PB14.GPIOParameters=GPIO_Label
PE0.GPIO_Label=PB1_ACTIVE
PCC.Seq0.Step0.Duration=0.05 ms
PCC.Seq0.Step1.DMIPS=0.0
RCC.APB1TimFreq_Value=72000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PCC.Seq0.Step0.Peripherals=
TIM1.Period=720
PB10.GPIOParameters=GPIO_Label
PCC.Seq0.Step1.Mode=STOP
PA4.GPIO_Label=ADC_SPI1_CSn
PE2.GPIO_Label=EN_DUT_PWR
PD15.Signal=GPIO_Input
ProjectManager.CustomerFirmwarePackage=
PB3.Locked=true
PB15.Locked=true
PA3.Signal=GPXTI3
PCC.Seq0.Step1.CPU_Frequency=0 Hz
PCC.Seq0.Step1.Memory=n/a
PB3.GPIO_Label=SWO
PA6.GPIOParameters=GPIO_Label
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
PCC.Seq0.Step0.Category=In DS Table
RCC.PLL3VCOoutputFreqValue=192000000
ProjectManager.ProjectFileName=power_logger.ioc
PD15.GPIO_Label=REV_2
ADC1.Rank-0\#ChannelRegularConversion=1
PB9.GPIO_Label=SWO
PA10.Mode=Asynchronous
Mcu.PinsNb=30
PCC.Seq0.Step0.Average_Current=28.3 mA
PCC.Vdd=3.3
ProjectManager.NoMain=false
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,master,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag
PA9.GPIO_Label=CONSOLE_TX
TIM1.Channel-Output\ Compare1\ No\ Output=TIM_CHANNEL_1
PB11.GPIO_Label=DISP_I2C2_SDA
PD13.GPIOParameters=GPIO_Label
ProjectManager.DefaultFWLocation=true
PB12.Locked=true
ProjectManager.DeletePrevious=true
PCC.Line=STM32F105/107
PC0.Signal=ADCx_IN10
PB14.Locked=true
RCC.APB1CLKDivider=RCC_HCLK_DIV2
PB10.Locked=true
PinOutPanel.CurrentBGAView=Top
RCC.FamilyName=M
RCC.I2S3Freq_Value=72000000
PB9.GPIOParameters=GPIO_Label
PA3.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
RCC.ADCPresc=RCC_ADCPCLK2_DIV6
PA13.Signal=SYS_JTMS-SWDIO
PCC.Seq0.Step0.TaMax=101.26
PCC.MCU=STM32F105V(8-B)Hx
PA9.Mode=Asynchronous
PB11.Mode=I2C
ProjectManager.TargetToolchain=STM32CubeIDE
PB10.GPIO_Label=DISP_I2C2_SCL
PCC.Seq0.Step1.User's_Consumption=0 mA
PCC.Seq0.Step0.Mode=RUN
PA9.Signal=USART1_TX
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
PB9.Locked=true
PB11.GPIOParameters=GPIO_Label
PE2.GPIOParameters=GPIO_Label
ProjectManager.RegisterCallBack=
OSC_IN.Signal=RCC_OSC_IN
PE0.Locked=true
RCC.USBFreq_Value=48000000
VP_FATFS_VS_Generic.Mode=User_defined
PB10.Signal=I2C2_SCL
PB14.Signal=SPI2_MISO
PA5.Signal=SPI1_SCK
board=custom
PCC.Temperature=25
SH.GPXTI3.0=GPIO_EXTI3
PE1.GPIO_Label=HLTH_LED
ProjectManager.LastFirmware=true
RCC.VCOOutput2Freq_Value=12000000
RCC.APB2Freq_Value=72000000
PCC.Seq0.Step0.Frequency=8 MHz
PCC.Seq0.Step0.Vcore=No Scale
MxCube.Version=6.2.1
PC0.GPIO_Mode=GPIO_MODE_ANALOG
PB15.GPIO_Label=SD_SPI2_MOSI
PE1.GPIO_Speed=GPIO_SPEED_FREQ_LOW
SH.ADCx_IN10.ConfNb=1
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PD14.GPIO_Label=REV_1
PA4.GPIOParameters=GPIO_Label
PB15.GPIOParameters=GPIO_Label
PA13.Mode=Trace_Asynchronous_SW
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreqValue,ADCPresc,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,I2S2Freq_Value,I2S3Freq_Value,MCOFreq_Value,PLL2CLKoutputFreqValue,PLL2VCOoutputFreqValue,PLL3CLKoutputFreqValue,PLL3VCOoutputFreqValue,PLLCLKFreq_Value,PLLMUL,PLLSourceVirtual,Prediv2FreqValue,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USBFreq_Value,VCOOutput2Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F105V(8-B)Hx
PE0.Signal=GPIO_Input
Mcu.Pin26=VP_FATFS_VS_Generic
Mcu.Pin27=VP_SYS_VS_Systick
PA13.GPIO_Label=SWDIO
Mcu.Pin24=PB11
ProjectManager.UnderRoot=true
Mcu.Pin25=PB12
NVIC.TIM1_CC_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PD14.Signal=GPIO_Input
Mcu.Pin28=VP_TIM1_VS_ClockSourceINT
Mcu.IP6=TIM1
Mcu.Pin29=VP_TIM1_VS_no_output1
Mcu.IP7=USART1
ProjectManager.CoupleFile=false
PCC.Seq0.Step0.Memory=FLASH
PB3.Signal=SYS_TRACESWO
PA4.Signal=SPI1_NSS
PD14.GPIOParameters=GPIO_Label
RCC.SYSCLKFreq_VALUE=72000000
Mcu.Pin22=PA3
Mcu.Pin23=PA7
RCC.TimSysFreq_Value=72000000
Mcu.Pin20=PB13
PA7.GPIO_Label=ADC_SPI1_MOSI
ADC1.master=1
PA3.Locked=true
Mcu.Pin21=PD13
PA10.Locked=true
PA5.GPIO_Label=ADC_SPI1_CLK
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
OSC_IN.Mode=HSE-External-Oscillator
PA14.GPIOParameters=GPIO_Label
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13.Locked=true
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
PD15.Locked=true
PA14.Signal=SYS_JTCK-SWCLK
SH.ADCx_IN10.0=ADC1_IN10,IN10
ProjectManager.HeapSize=0x200
Mcu.Pin15=PA5
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB14
Mcu.Pin13=PB15
Mcu.Pin14=PD15
Mcu.Pin19=PB10
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PD14
Mcu.Pin18=PA6
PCC.Seq0.Step1.Frequency=0 Hz
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PC0
Mcu.Pin12=PA4
Mcu.Pin10=PA10
PCC.Seq0.Step1.Peripherals=
PE2.Locked=true
PCC.Seq0.Step1.Vcore=No Scale
PCC.Seq0.Step1.Voltage_Source=Battery
PCC.Seq0.Step0.Vdd=3.3
PCC.Seq0=2
RCC.APB1Freq_Value=36000000
RCC.PLL2VCOoutputFreqValue=192000000
PA7.GPIOParameters=GPIO_Label
PC0.Locked=true
PB11.Locked=true
ProjectManager.DeviceId=STM32F105VBHx
PB12.GPIOParameters=GPIO_Label
PB12.Signal=SPI2_NSS
ProjectManager.LibraryCopy=1
PE1.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_ModeDefaultOutputPP
PA3.GPIO_Label=ADC_ALRTn
RCC.Prediv2FreqValue=12000000
PA7.Signal=SPI1_MOSI
PA6.Locked=true
isbadioc=false
